---
kind: property
id: P:Autodesk.Revit.DB.FabricationPart.ProductCode
source: html/5750255d-bc7d-dea2-d38b-d84beeae5e8e.htm
---
# Autodesk.Revit.DB.FabricationPart.ProductCode Property

The current database id of the part within the fabrication database.

## Syntax (C#)
```csharp
public string ProductCode { get; }
```